{
  "basics": {
      "name": "LING YANG",
      "label": "Researcher in Mechanical Engineering",
      "email": "lyangr@connect.hku.hk",
      "phone": "(852)46744580/(86)18792977265",
      "location": {
          "address": "304 Haking Wong Building, The University of Hong Kong, Pokfulam Road, Hong Kong SAR, 999077, P. R. China",
          "city": "Hong Kong",
          "countryCode": "CN"
      },
      "summary": "A researcher with a strong background in mechanical engineering, experienced in microfluidics, soft matter research, and various engineering projects. Skilled in multiple technical tools and has a track record of academic achievements and awards."
  },
  "education": [
      {
          "institution": "The University of Hong Kong",
          "area": "Mechanical Engineering",
          "studyType": "Ph.D.",
          "startDate": "2021",
          "endDate": "2025",
          "gpa": "",
          "courses": [],
          "researchTopic": "microfluidics and soft matter",
          "supervisors": ["Prof. Xiaobo Yin (xbyin@hku.hk)", "Prof. Liqiu Wang (liqiu.wang@polyu.edu.hk)"]
      },
      {
          "institution": "Xi'an Jiaotong University",
          "area": "Power Engineering and Engineering Thermophysics",
          "studyType": "Master",
          "startDate": "2016",
          "endDate": "2019",
          "gpa": "",
          "courses": []
      },
      {
          "institution": "Xi'an Jiaotong University",
          "area": "Process Equipment and Control Engineering (Major), Law (Minor)",
          "studyType": "Bachelor",
          "startDate": "2012",
          "endDate": "2016",
          "gpa": "90.13/100",
          "courses": []
      }
  ],
  "work": [
      {
          "company": "Southern University of Science and Technology",
          "position": "RA",
          "website": "",
          "startDate": "2020",
          "endDate": "2021",
          "summary": "Conducted research on 3D printing in the field of Mechanical and Energy Engineering.",
          "highlights": []
      }
  ],
  "publications": [
    {  "title": "Selective directional liquid transport on shoot surfaces of Crassula muscosa",
        "publication": "Science",
        "volume": "384",
        "issue": "adk4180",
        "year": "2024",
        "authors": "L. Yang#, W. Li#, J. Y. Lian, H. J. Zhu, Q. Y. Deng, J. Q. Li*, X. B. Yin*, L. Q. Wang*",
        "impactFactor": "44.7",
        "highlights": "Visualized by ScienceAdviser; Highlighted by Science, EurekAlert!, Phys.org, ScienceDaily, Washington City Paper, Weekender Singapore, Hong Kong Commercial Daily, etc"
        },
        {
        "title": "Selective directional liquid transport on shoot surfaces of Crassula muscosa",
        "publisher": "American Association for the Advancement of Science",
        "publication": "Science",
        "releaseDate": "2024",
        "authors": "L. Yang#, W. Li#, J. Y. Lian, H. J. Zhu, Q. Y. Deng, J. Q. Li*, X. B. Yin*, L. Q. Wang*",
        "url": "https://www.science.org/doi/abs/10.1126/science.adk4180",
        "summary": "Unveiled an unexpected selective directional liquid transport on shoot surfaces of Crassula muscosa, different from hitherto reported liquid transports on other nature species. Achieved smart and reconfigurable liquid transport on engineered biomimetic counterparts by employing mechanical or magnetic stimuli. (IF: 44.7; Visualized by ScienceAdviser; Highlighted by Science, EurekAlert!, Phys.org, ScienceDaily, Washington City Paper, Weekender Singapore, Hong Kong Commercial Daily, etc)"
        },
        {
        "title": "Nature-inspired reentrant surfaces",
        "publisher": "Pergamon",
        "publication": "Progress in Materials Science",
        "releaseDate": "2023",
        "authors": "J. Q. Li#*, X. Han#, W. Li#, L. Yang, X. Li*, L. Q. Wang*",
        "url": "https://www.sciencedirect.com/science/article/abs/pii/S0079642522001451",
        "summary": "Reentrant feature widely exists in natural structures ranging from mushroom, overhang, undercut, trapezoid, sphere, spatula and taper to sharp edge, and has triggered a biomimetic design revolution of functional surfaces for extreme repellency to fluid foulants, directional fluid navigation, and strong adaptive adhesion. In this Review, we discuss how the bionic introduction of reentrant feature on a surface mediates fluid wetting, contact line motion, as well as solid adhesion. We briefly introduce nature-inspired design principles from representative reentrant surfaces on the springtail, gecko, and pitcher plant. Through quantitatively associating microscopic structural parameters of reentrant feature, including angle, shape, diameter, thickness, sharpness and anisotropy, with macroscopically visible wetting and adhesion properties, we evaluate how the design of reentrant feature can enable exceptional ",
        "impactFactor": "33.6"
        },
        {
        "title": "Droplet bouncing: Fundamentals, regulations, and applications",
        "publication": "Small",
        "releaseDate": "2022",
        "authors": "X. Han#, J. Q. Li#, X. Tang, W. Li, H. B. Zhao, L. Yang, L.Q. Wang*",
        "url": "https://onlinelibrary.wiley.com/doi/abs/10.1002/smll.202200277",
        "summary": "Droplet impact is a ubiquitous phenomenon in nature, daily life, and industrial processes. It is thus crucial to tune the impact outcomes for various applications. As a special outcome of droplet impact, the bouncing of droplets keeps the form of the droplets after the impact and minimizes the energy loss during the impact, being beneficial in many applications. A unified understanding of droplet bouncing is in high demand for effective development of new techniques to serve applications. This review shows the fundamentals, regulations, and applications of millimeter‐sized droplet bouncing on solid surfaces and same/miscible liquids (liquid pool and another droplet). Regulation methods and current applications are summarized, and potential directions are proposed.",
        "impactFactor": "13.0"
        }
  ],
  "awards": [
      {
          "title": "Fluigent Microfluidics Award",
          "date": "2024",
          "awarder": ""
      },
      {
          "title": "Y S and Christabel Lung Postgraduate Scholarship, Faculty of Engineering",
          "date": "2021",
          "awarder": ""
      },
      {
          "title": "Hui Pun Hing Memorial Postgraduate Fellowships (Mainland Collaborations)",
          "date": "2021",
          "awarder": ""
      },
      {
          "title": "Eight times scholarships, twice Outstanding Graduate, and three times Outstanding Student",
          "date": "2012 - 2019",
          "awarder": ""
      }
  ],
  "skills": [
      {
          "name": "Teaching",
          "level": "Experienced",
          "keywords": ["MECH2414 Thermofluids (2022 - 2023, Teaching assist at The University of Hong Kong)"]
      },
      {
          "name": "Technical Courses",
          "level": "Proficient",
          "keywords": ["Engineering Thermodynamics", "Fluid Mechanics", "Computational Method", "Material Mechanics", "Numerical heat transfer", "Nanophotonics"]
      },
      {
          "name": "Computer Tools",
          "level": "Proficient",
          "keywords": ["MATLAB", "Simulink", "Python", "COMSOL", "Auto CAD", "Labview"]
      }
  ],
  "projects": [

      {
          "name": "Selective directional liquid transport on biological surface",
          "startDate": "Sep. 2021",
          "endDate": "Mar. 2024",
          "description": "Unveiled an unexpected selective directional liquid transport on shoot surfaces of Crassula muscosa, different from hitherto reported liquid transports on other nature species. Achieved smart and reconfigurable liquid transport on engineered biomimetic counterparts by employing mechanical or magnetic stimuli.",
          "highlights": []
      },
      {
          "name": "Infrared 3D printer development",
          "startDate": "2020",
          "endDate": "2021",
          "description": "Designed a microscopic and thermal field observation platform to explore the sintering and melting processes of polymer powders under infrared heat.",
          "highlights": []
      },
      {
          "name": "Micro-compressor inflation process",
          "startDate": "2017",
          "endDate": "2019",
          "description": "Calculated the thermodynamic and kinetic parameters using Runge-Kutta methods in MATLAB, based on an improved transient heat and mass transfer model. Developed a speed-current double closed-loop PI control for the motor-compressor system using Simulink.",
          "highlights": []
      },
      {
          "name": "High-pressure compressor performance test",
          "startDate": "2015",
          "endDate": "2017",
          "description": "Awarded an Excellent Bachelor's Dissertation from Xi'an Jiaotong University.",
          "highlights": []
      },
      {
          "name": "Novel disc-type pressure exchanger for seawater desalination energy recovery",
          "startDate": "2015",
          "endDate": "",
          "description": "Awarded an Excellent Award in National Undergraduate Innovation Training Project.",
          "highlights": []
      }
  ]
}