{"basics":{"name":"LING YANG","label":"Researcher in Mechanical Engineering","email":"lyangr@connect.hku.hk","location":{"address":"304 Haking Wong Building, The University of Hong Kong, Pokfulam Road, Hong Kong SAR, 999077, P. R. China","city":"Hong Kong","countryCode":"CN"},"summary":"A researcher with a strong background in mechanical engineering, experienced in microfluidics, soft matter research, and various engineering projects. Skilled in multiple technical tools and has a track record of academic achievements and awards."},"education":[{"institution":"The University of Hong Kong","area":"Mechanical Engineering","studyType":"Ph.D.","startDate":"2021","endDate":"2025","gpa":"","courses":[],"researchTopic":"microfluidics and soft matter","supervisors":["Prof. Xiaobo Yin (xbyin@hku.hk)","Prof. Liqiu Wang (liqiu.wang@polyu.edu.hk)"]},{"institution":"Xi'an Jiaotong University","area":"Power Engineering and Engineering Thermophysics","studyType":"Master","startDate":"2016","endDate":"2019","gpa":"","courses":[]},{"institution":"Xi'an Jiaotong University","area":"Process Equipment and Control Engineering (Major), Law (Minor)","studyType":"Bachelor","startDate":"2012","endDate":"2016","gpa":"90.13/100","courses":[]}],"work":[{"company":"Southern University of Science and Technology","position":"RA","website":"","startDate":"2020","endDate":"2021","summary":"Conducted research on 3D printing in the field of Mechanical and Energy Engineering.","highlights":[]}],"publications":[{"title":"Selective directional liquid transport on shoot surfaces of Crassula muscosa","publisher":"Science","releaseDate":"2024","url":"","summary":"Unveiled an unexpected selective directional liquid transport on shoot surfaces of Crassula muscosa, different from hitherto reported liquid transports on other nature species. Achieved smart and reconfigurable liquid transport on engineered biomimetic counterparts by employing mechanical or magnetic stimuli. (IF: 44.7; Visualized by ScienceAdviser; Highlighted by Science, EurekAlert!, Phys.org, ScienceDaily, Washington City Paper, Weekender Singapore, Hong Kong Commercial Daily, etc)"}],"awards":[{"title":"Fluigent Microfluidics Award","date":"2024","awarder":""},{"title":"Y S and Christabel Lung Postgraduate Scholarship, Faculty of Engineering","date":"2021","awarder":""},{"title":"Hui Pun Hing Memorial Postgraduate Fellowships (Mainland Collaborations)","date":"2021","awarder":""},{"title":"Eight times scholarships, twice Outstanding Graduate, and three times Outstanding Student","date":"2012 - 2019","awarder":""}],"skills":[{"name":"Teaching","level":"Experienced","keywords":["MECH2414 Thermofluids (2022 - 2023, Teaching assist at The University of Hong Kong)"]},{"name":"Technical Courses","level":"Proficient","keywords":["Engineering Thermodynamics","Fluid Mechanics","Computational Method","Material Mechanics","Numerical heat transfer","Nanophotonics"]},{"name":"Computer Tools","level":"Proficient","keywords":["MATLAB","Simulink","Python","COMSOL","Auto CAD","Labview"]}],"projects":[{"name":"Droplet manipulation","startDate":"Feb. 2023","endDate":"now","description":"Remote, precise, robust, and loss-free control of diverse droplets on a superomniphobic surface. Distinguished from traditional electrowetting on dielectric (EWOD) by a different working mechanism and a simpler and cheaper platform without complex electrode patterns.","highlights":[]},{"name":"Selective directional liquid transport on biological surface","startDate":"Sep. 2021","endDate":"Mar. 2024","description":"Unveiled an unexpected selective directional liquid transport on shoot surfaces of Crassula muscosa, different from hitherto reported liquid transports on other nature species. Achieved smart and reconfigurable liquid transport on engineered biomimetic counterparts by employing mechanical or magnetic stimuli.","highlights":[]},{"name":"Infrared 3D printer development","startDate":"2020","endDate":"2021","description":"Designed a microscopic and thermal field observation platform to explore the sintering and melting processes of polymer powders under infrared heat.","highlights":[]},{"name":"Micro-compressor inflation process","startDate":"2017","endDate":"2019","description":"Calculated the thermodynamic and kinetic parameters using Runge-Kutta methods in MATLAB, based on an improved transient heat and mass transfer model. Developed a speed-current double closed-loop PI control for the motor-compressor system using Simulink.","highlights":[]},{"name":"High-pressure compressor performance test","startDate":"2015","endDate":"2017","description":"Awarded an Excellent Bachelor's Dissertation from Xi'an Jiaotong University.","highlights":[]},{"name":"Novel disc-type pressure exchanger for seawater desalination energy recovery","startDate":"2015","endDate":"","description":"Awarded an Excellent Award in National Undergraduate Innovation Training Project.","highlights":[]}]}